Ran Plan for dir: `50-eks-demo` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "mkdir -p /tmp/$BASE_REPO_OWNER-$BASE_REPO_NAME-$PULL_NUM\ninfracost breakdown --path=$SHOWFILE --format=json --log-level=info --out-file=$INFRACOST_OUTPUT\n" in "/home/atlantis/.atlantis/repos/opspresso/terraform-env-demo/10/default/50-eks-demo": exit status 1: running "mkdir -p /tmp/$BASE_REPO_OWNER-$BASE_REPO_NAME-$PULL_NUM\ninfracost breakdown --path=$SHOWFILE --format=json --log-level=info --out-file=$INFRACOST_OUTPUT\n" in "/home/atlantis/.atlantis/repos/opspresso/terraform-env-demo/10/default/50-eks-demo": 
time="2022-09-06T05:26:00Z" level=info msg="Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/opspresso/terraform-env-demo/10/default/50-eks-demo/default.json"
time="2022-09-06T05:26:00Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-09-06T05:26:01Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"

Error: Invalid API response: 464 
We have been notified of this issue.


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.workers-v1.aws_autoscaling_group.worker[0] has changed
~ resource "aws_autoscaling_group" "worker" {
      ~ desired_capacity          = 4 -> 3
        id                        = "eks-demo-workers-v1-20220829021700621400000017"
        name                      = "eks-demo-workers-v1-20220829021700621400000017"
        # (23 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.graviton-v1.aws_autoscaling_group.worker[0] will be created
+ resource "aws_autoscaling_group" "worker" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "eks-demo-graviton-v1-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "subnet-0842c4c3776c09e81",
          + "subnet-0a0f1761b255fc975",
          + "subnet-0e1931cbfaf225aa6",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "demo"
        }
      + tag {
          + key                 = "KubernetesCluster"
          + propagate_at_launch = true
          + value               = "eks-demo"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "eks-demo-graviton-v1"
        }
      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/eks-demo"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "krmt.io/group"
          + propagate_at_launch = true
          + value               = "graviton"
        }
      + tag {
          + key                 = "krmt.io/instancegroup"
          + propagate_at_launch = true
          + value               = "graviton-v1"
        }
      + tag {
          + key                 = "krmt.io/subgroup"
          + propagate_at_launch = true
          + value               = "graviton-v1"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/eks-demo"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.graviton-v1.aws_autoscaling_lifecycle_hook.nth[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "nth" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-asg-termination"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-scheduled-change"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-spot-termination"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "eks-demo-graviton-v1-state-change"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_asg" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-asg-termination"
      + target_id      = "eks-demo-graviton-v1-asg-termination"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_scheduled" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-scheduled-change"
      + target_id      = "eks-demo-graviton-v1-scheduled-change"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_spot" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-spot-termination"
      + target_id      = "eks-demo-graviton-v1-spot-termination"
    }

  # module.graviton-v1.aws_cloudwatch_event_target.nth_state[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_state" {
      + arn            = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-worker"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "eks-demo-graviton-v1-state-change"
      + target_id      = "eks-demo-graviton-v1-state-change"
    }

  # module.graviton-v1.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-demo-graviton-v1"
      + path        = "/"
      + role        = "eks-demo-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.graviton-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = "ami-01215679379561f70"
      + instance_type   = "c6g.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "eks-demo-graviton-v1-spot-"
      + tags            = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-graviton-v1"
          + "krmt.io/group"                  = "graviton"
          + "krmt.io/instancegroup"          = "graviton-v1"
          + "krmt.io/subgroup"               = "graviton-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + tags_all        = {
          + "Environment"                    = "demo"
          + "KubernetesCluster"              = "eks-demo"
          + "Name"                           = "eks-demo-graviton-v1"
          + "krmt.io/group"                  = "graviton"
          + "krmt.io/instancegroup"          = "graviton-v1"
          + "krmt.io/subgroup"               = "graviton-v1"
          + "kubernetes.io/cluster/eks-demo" = "owned"
        }
      + user_data       = (sensitive)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "eks-demo-graviton-v1"
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = [
              + "sg-020a8a7bdd0104bfc",
              + "sg-093fbd6412584e20f",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-graviton-v1"
              + "krmt.io/group"                  = "graviton"
              + "krmt.io/instancegroup"          = "graviton-v1"
              + "krmt.io/subgroup"               = "graviton-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment"                    = "demo"
              + "KubernetesCluster"              = "eks-demo"
              + "Name"                           = "eks-demo-graviton-v1"
              + "krmt.io/group"                  = "graviton"
              + "krmt.io/instancegroup"          = "graviton-v1"
              + "krmt.io/subgroup"               = "graviton-v1"
              + "kubernetes.io/cluster/eks-demo" = "owned"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.


```
</details>

